/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ช่วยทำให้ลดความซ้ำซ้อนของการเขียนโค้ด

2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: อ่่านง่ายขึ้นเพราะสามารถอ่านจากตัว Higher-Order Function ไปที่ Callback ทำให้เราเข้าใจ flow การทำงานได้เป็นขั้นตอน 
และรู้ว่าฟังก์ชันจะทำอะไรต่อเมื่อเกิดเหตุการณ์หรือเงื่อนไขใด

3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer: Higher-Order Function จะเป็นฟังก์ชันที่เสามารถรับฟังก์ชันอื่นเป้น Parameter ได้ ซึ่งฟังก์ชันที่ถูกส่งเข้าไปเรียกว่า Callback Function 
        ยกตัวอย่างเช่น โปรแกรมคิดเลขที่รับตัวเลข 2 ค่า ถ้าเขียนแยกฟังก์ชันบวก ลบ คูณ หาร ทีละอัน โค้ดจะยาวและซ้ำซ้อน
        แต่ถ้าใช้ Higher-Order Function สามารถเขียนฟังก์ชันหลักแค่ครั้งเดียว แล้วส่ง Callback เข้าไปกำหนดว่าจะคำนวณแบบไหน 
        ทำให้โค้ดสั้นลง อ่านง่ายขึ้น
*/
